Tekla.Structures.Plugins.CustomPartBase.CustomPartInputType
Defines the type of the input.

Tekla.Structures.Plugins.CustomPartBase.CustomPartInputType.INPUT_2_POINTS
The input is two points. The data is returned as an array list of points. Default value.

Tekla.Structures.Plugins.CustomPartBase.CustomPartInputType.INPUT_1_POINT
The input is one point. The data is returned as an array list of points.